
/*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
                              printf.c

++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
                                                    Forrest Yu, 2005
                                                    Edward      2013
++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/

#include "type.h"
#include "const.h"


/*======================================================================*
                                 printf
 *======================================================================*/
int printf(const char *fmt, ...)
{
	int i;
	char buf[256];

	va_list arg = (va_list)((char*)(&fmt) + 4);        /* 4 是参数 fmt 所占堆栈中的大小 */
	i = vsprintf(buf, fmt, arg);
	write(buf, i);

	return i;
}
/*======================================================================*
                                 strcmp
 *======================================================================*/
int strcmp(char *a,char *b){
    int ret = 0;
    while( !(ret = *a-*b) && *b){
        if(*a==0){
            return 0-*b;
        }
        ++a,++b;
    }
    return ret;
}
/*======================================================================*
                                 explode
 *======================================================================*/
int explode(char *buf, ...){
    int len = strlen(buf);
    char tmp[256];
    char *p = tmp;
    int t_len = 0;
    int c_len = 0;
    int i;
    va_list arg = (va_list)((char*)(&buf) + 4);        /* 4 是参数 fmt 所占堆栈中的大小 */
    for(i=0; i<len+1; i++){

        if(buf[i]==0x20 || i==len){
            *p = 0;
            p = tmp;
            c_len ++;
            
            memcpy(*((char**)arg),tmp,t_len+1);
            arg += 4;
        }else{
            *p=buf[i];
            t_len++;
            p++;
        }
    }
    return c_len;
}
